#+TITLE: ライフハックの道具箱 こなゆき担当原稿
#+PROPERTY: header-args       :mkdirp yes
#+OPTIONS: \n:t

書籍『ライフハックの道具箱 2022年版』に投稿する[[https://twitter.com/_p_snow][こなゆき]]の原稿

* 原稿提出までの手順
:PROPERTIES:
:CREATED:  [2022-11-18 Fri 09:46]
:END:

1. このファイルの中で「文芸的執筆」スタイルで原稿を執筆
   - 各ステータス(現在の文字数、など)はC-x C-v bでアップデートされる
2. コマンド'make tangle'で提出稿の書き出し
   - Emacs内で作業していれば[[file:~/ghq/github.com/p-snow/publications/tangle.el][ファイルセーブするタイミングで上記コマンドが自動実行される仕組み]]になってる
3. 倉下さんに提出用ファイルの場所を伝える

   提出用ファイルの保存フォルダ
   #+name: lhack-toolbox-dir
   #+begin_src emacs-lisp :tangle no :noweb yes :exports results
     (file-relative-name
      (expand-file-name "../public/ライフハックの道具箱2022年版" ".")
      default-directory)
   #+end_src

   #+RESULTS: lhack-toolbox-dir
   : ../public/ライフハックの道具箱2022年版

** Emacs
:PROPERTIES:
:CREATED:  [2022-11-09 Wed 16:45]
:header-args+: :tangle "../public/ライフハックの道具箱2022年版/emacs.txt"
:ID:       8754255c-d0e2-4b90-98d5-a3ea009c3db2
:END:

Emacsセクションのアウトプットファイル (提出用)
#+name: output-emacs
#+begin_src emacs-lisp :tangle no :noweb yes :exports results
  (file-relative-name
   (file-name-concat "<<lhack-toolbox-dir()>>" "emacs.txt")
   default-directory)
#+end_src

#+RESULTS: output-emacs
: ../public/ライフハックの道具箱2022年版/emacs.txt

現在の文字数 (目安: 2,000文字前後)
#+begin_src shell :tangle no :noweb yes :exports results
  echo -n $(cat <<output-emacs()>> | wc -m) '文字'
#+end_src

#+RESULTS:
: 2176 文字

自動原稿チェック結果
#+begin_src shell :tangle no :noweb yes :results output :exports results
  cat "<<output-emacs()>>" | textlint --stdin --config ../config/lhack-tbox.textlintrc | cat -
#+end_src

#+RESULTS:
#+begin_example

<text>
   1:8    ✓ error  パソコン => PC                                                                                                  spellcheck-tech-word
   1:37   ✓ error  MacOS => Mac OS                                                                                                 spellcheck-tech-word
   3:70   error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
   4:15   ✓ error  Mac OS => MacOS                                                                                                 prh
   8:66   ✓ error  Webブラウザ => ブラウザ                                                                                         spellcheck-tech-word
   8:289  ✓ error  一つ => 1つ
数量を表現し、数を数えられるものは算用数字を使用します。任意の数に置き換えても通用する語句がこれに該当します。  ja-technical-writing/arabic-kanji-numbers
  10:112  error    一つの文で"、"を4つ以上使用しています                                                                           ja-technical-writing/max-ten

✖ 7 problems (7 errors, 0 warnings)
✓ 5 fixable problems.
Try to run: $ textlint --fix [file]

#+end_example

** Org Mode
:PROPERTIES:
:ID:       f2ac8a38-bc45-4566-8b50-262cc0c5ac07
:header-args+: :tangle "../public/ライフハックの道具箱2022年版/org-mode.txt"
:END:

Org-modeセクションのアウトプットファイル (提出用)
#+name: output-org
#+begin_src emacs-lisp :tangle no :noweb yes :exports results
  (file-relative-name
   (file-name-concat "<<lhack-toolbox-dir()>>" "org-mode.txt")
   default-directory)
#+end_src

#+RESULTS: output-org
: ../public/ライフハックの道具箱2022年版/literate-writing.txt

現在の文字数 (目安: 2,000文字前後)
#+begin_src shell :tangle no :noweb yes :exports results
  echo -n $(cat <<output-org()>> | wc -m) '文字'
#+end_src

#+RESULTS:
: 2000 文字

自動原稿チェック結果
#+begin_src shell :tangle no :noweb yes :results output :exports results
  cat "<<output-org()>>" | textlint --stdin --config ../config/lhack-tbox.textlintrc | cat -
#+end_src

#+RESULTS:
#+begin_example

<text>
   3:11  ✓ error  コンピュータ => パソコン                                                                                        prh
  13:21  ✓ error  文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  15:80  error    一文に二回以上利用されている助詞 "で" がみつかりました。                                                        ja-technical-writing/no-doubled-joshi
  34:7   ✓ error  二つ => 2つ
数量を表現し、数を数えられるものは算用数字を使用します。任意の数に置き換えても通用する語句がこれに該当します。  ja-technical-writing/arabic-kanji-numbers
  36:9   error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  41:33  error    弱い表現: "思います" が使われています。                                                                         ja-technical-writing/ja-no-weak-phrase
  47:4   error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  48:25  error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  51:40  error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  53:18  error    文末が"。"で終わっていません。                                                                                  ja-technical-writing/ja-no-mixed-period
  57:47  error    弱い表現: "かも" が使われています。                                                                             ja-technical-writing/ja-no-weak-phrase

✖ 11 problems (11 errors, 0 warnings)
✓ 3 fixable problems.
Try to run: $ textlint --fix [file]

#+end_example

** 「文芸的プログラミング」と原稿執筆への応用
:PROPERTIES:
:CREATED:  [2022-11-18 Fri 16:01]
:header-args+: :tangle "../public/ライフハックの道具箱2022年版/literate-writing.txt"
:END:

Org-modeセクションのアウトプットファイル (提出用)
#+name: output-literate
#+begin_src emacs-lisp :tangle no :noweb yes :exports results
  (file-relative-name
   (file-name-concat "<<lhack-toolbox-dir()>>" "literate-writing.txt")
   default-directory)
#+end_src

#+RESULTS: output-literate
: ../public/ライフハックの道具箱2022年版/literate-writing.txt

現在の文字数 (目安: 2,000文字前後)
#+begin_src shell :tangle no :noweb yes :exports results
  echo -n $(cat <<output-literate()>> | wc -m) '文字'
#+end_src

#+RESULTS:
: 1931 文字

自動原稿チェック結果
#+begin_src shell :tangle no :noweb yes :results output :exports results
  cat "<<output-literate()>>" | textlint --stdin --config ../config/lhack-tbox.textlintrc | cat -
#+end_src

#+RESULTS:
#+begin_example

<text>
  3:29   ✓ error  コンピュータ => パソコン                                                                                        prh
  5:135  ✓ error  コンピュータ => パソコン                                                                                        prh
  5:369  ✓ error  コンピュータ => パソコン                                                                                        prh
  9:98   ✓ error  一つ => 1つ
数量を表現し、数を数えられるものは算用数字を使用します。任意の数に置き換えても通用する語句がこれに該当します。  ja-technical-writing/arabic-kanji-numbers

✖ 4 problems (4 errors, 0 warnings)
✓ 4 fixable problems.
Try to run: $ textlint --fix [file]

#+end_example

